#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy.aws_managed_ecr_full_access: Reading...
module.irsa-ebs-csi.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Reading...
data.aws_iam_policy.aws_managed_read_only_access: Reading...
data.aws_iam_policy.aws_managed_ecr_readonly_policy: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_iam_policy.aws_ec2_full_access: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.irsa-ebs-csi.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_iam_policy.ebs_csi_policy: Reading...
data.aws_iam_policy.aws_managed_s3_full_access: Reading...
aws_ecr_repository.msccoin_file_system: Refreshing state... [id=msccoin_file_system]
aws_iam_role.image_reflector_controller: Refreshing state... [id=image-reflector-controller]
data.aws_iam_policy.aws_ec2_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2FullAccess]
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser]
data.aws_iam_policy.aws_managed_ecr_readonly_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
data.aws_iam_policy.aws_managed_ecr_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess]
aws_ecr_repository.msccoin_frontend: Refreshing state... [id=msccoin_frontend]
module.irsa-ebs-csi.data.aws_caller_identity.current: Reading...
data.aws_iam_policy.ebs_csi_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
data.aws_iam_policy.aws_managed_s3_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonS3FullAccess]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d352d0be7616dba7]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
aws_iam_role_policy_attachment.tf_service_role_for_ecr_policy_attachment: Refreshing state... [id=image-reflector-controller-20241015101805373600000001]
data.aws_iam_policy.aws_managed_read_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::476114114107:assumed-role/github-oidc-role/terraform-infra-provision-session]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=476114114107]
module.irsa-ebs-csi.data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08b44cd0aff095a31]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-01ee9d7dc927d91ee]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c695205d81ad6c00]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0be6cc3dcf01ea474]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-01f2a7884dc62b52b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a00b0e6b415ea169]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-026e02489ec0ad3a8]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-02944c69f40acfac3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c088c92655cd4638]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-055c7a568866428d2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d78a411bb570b690]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03584312e5dd1cf97]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0827cb38c403daa17]
module.vpc.aws_subnet.public[3]: Refreshing state... [id=subnet-0def96dc3e9bbeb2e]
module.vpc.aws_subnet.public[4]: Refreshing state... [id=subnet-0d9101eb06da66f9f]
module.vpc.aws_subnet.public[5]: Refreshing state... [id=subnet-01752b63df6fd01d1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3b0c83b13734fe5]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-01d7b9db327b68d77]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-028bfb48c3b9cfd2c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-007f62bb438496a80]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08f58e87c1a6c4c8a]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0f262f2416a16f84e]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0d401e0b08ef9238b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09de28afb9c5e1323]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0235b1bdf2bf02750]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05b50dc0834c5958f]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-08349a50bad0fbaae]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0313ea15195b356af]
module.vpc.aws_route_table_association.public[5]: Refreshing state... [id=rtbassoc-0c60db63742b3962c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dcf6ebe36939c85e]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01678d118c651a82c]
module.vpc.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-0d49e4f5a986680bb]
module.vpc.aws_route_table_association.public[4]: Refreshing state... [id=rtbassoc-0fa3f2f89f3457195]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ea25e2b01d757771]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dfc3b169d203524d]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a64fef9f2231fb55]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-007f62bb438496a801080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-083677cda38d168b9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00ace327875109aec]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-08d546a8e727231b8]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-028bfb48c3b9cfd2c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-01d7b9db327b68d771080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3b0c83b13734fe51080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/mscoin-int-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/eks/mscoin-int-eks/cluster"
        }
      + tags_all          = {
          + "Name" = "/aws/eks/mscoin-int-eks/cluster"
        }
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "mscoin-int-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::476114114107:role/github-oidc-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "mscoin-int-eks"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::476114114107:role/github-oidc-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "mscoin-int-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01f2a7884dc62b52b",
              + "subnet-026e02489ec0ad3a8",
              + "subnet-02944c69f40acfac3",
              + "subnet-055c7a568866428d2",
              + "subnet-0a00b0e6b415ea169",
              + "subnet-0c088c92655cd4638",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "mscoin-int-eks-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "mscoin-int-eks-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "mscoin-int-eks-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "mscoin-int-eks-cluster-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "mscoin-int-eks-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mscoin-int-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "mscoin-int-eks-cluster"
        }
      + tags_all               = {
          + "Name" = "mscoin-int-eks-cluster"
        }
      + vpc_id                 = "vpc-0d352d0be7616dba7"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mscoin-int-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "mscoin-int-eks-node"
          + "kubernetes.io/cluster/mscoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                                 = "mscoin-int-eks-node"
          + "kubernetes.io/cluster/mscoin-int-eks" = "owned"
        }
      + vpc_id                 = "vpc-0d352d0be7616dba7"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["postgresql_service_ingress_rule_1"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "pg ingress 1"
      + from_port                = 15232
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 15232
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "mscoin-int-eks"
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.29"
        }
    }

  # module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
    }

  # module.irsa-ebs-csi.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKSTFEBSCSIRole-ap-east-1-mscoin-int-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKSTFEBSCSIRole-ap-east-1-mscoin-int-eks"
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "mscoin-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "nodegroup" = "k8s-core"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "k8s-core-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-02944c69f40acfac3",
          + "subnet-0a00b0e6b415ea169",
          + "subnet-0c088c92655cd4638",
        ]
      + tags                   = {
          + "Name"                                     = "k8s-core"
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                                     = "k8s-core"
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + version                = "1.29"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 10
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "k8s-core-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + tags_all              = {
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for k8s-core EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "k8s-core-"
      + tags                   = {
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
          + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"                                     = "k8s-core"
              + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
              + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                                     = "k8s-core"
              + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
              + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                                     = "k8s-core"
              + "k8s.io/cluster-autoscaler/enabled"        = "TRUE"
              + "k8s.io/cluster-autoscaler/mscoin-int-eks" = "owned"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::476114114107:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::476114114107:role/github-oidc-role",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/mscoin-int-eks"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "mscoin-int-eks cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                           = {
          + "terraform-aws-modules" = "eks"
        }
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks/main.tf line 387, in resource "aws_iam_role" "this":
 387: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DavidGoodman2333, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infra Plan - AP Southeast 1`*